---
title: 关于我
date: 2016-06-18 11:11:52
---
### 热爱前端，热爱生活

也思考过为什么自己这么热爱前端，而不是其他任何语言。
<!---->
但不管原因是什么，本骚年爱这样无拘无束的语言，爱这种容许无限大脑洞的平台。
<!---->
骚年热爱钻研原理，像jQuery源码解析、AngularJs的实现原理、解剖React虚拟DOM等等。但毕竟还不是老司机，只能膜拜大神们的大作，然后写点学习笔记，又或是项目遇到的问题记下来呗。
<!---->
热爱生活呀，即使现在少了发现幸福片段、记录喜悦心情的时候，但依然爱这个世界，死心塌地哈哈。

### 欢迎大牛指导，以及小伙伴们切磋

一直抱着期盼在某年某月某日会遇到一些前端的大牛们，看看他们是如何架构、使用些什么工具、写代码的时候都在考虑些什么。
<!---->
也一直期待着有一堆志气相投的小伙伴们，一起分享各自的想法，一起切磋，一起解决问题。
<!---->
> 邮箱：wangbeishan@163.com
> QQ: 1780096742
> Github: [https://github.com/godbasin](https://github.com/godbasin)

### 许个愿吧

互联网的世界，是允许弱小的人许下大愿望的呀。
:)